In [4]:
import pandas as pd

## Learning about the data frame and series data types

### Storing information in dictionaries

In [194]:
#representing data for a single person.
#The keys are the columns, the values are the rows
person = {
    "first" : "Chidinma",
    "last" : "Ukaegbu",
    "email" : "chidinmaukaegbu.cu@gmail.com"
}

In [195]:
#representing data for single person using lists
person_1 = {
    "first" : ["Chidinma"],
    "last" : ["Ukaegbu"],
    "email" : ["chidinmaukaegbu.cu@gmail.com"]
}

In [5]:
#representing data for multiple people using lists

people = {
    "first" : ["Chidinma", "Mary", "Mark", "Lekan"],
    "last" : ["Ukaegbu", "Sleep", "Okoro", "Okoro"],
    "email" : ["chidinmaukaegbu.cu@gmail.com", "marysleep@gmail.com", "markokoro@gmail.com", "lekanokoro@gmail.com"]
}

In [6]:
people['email']

['chidinmaukaegbu.cu@gmail.com',
 'marysleep@gmail.com',
 'markokoro@gmail.com',
 'lekanokoro@gmail.com']

In [7]:
type(people['email'])

list

In [32]:
df = pd.DataFrame(people)
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

### How to access information within the dataframe

In [33]:
#Accessing the values of a single column

df['email']

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
2             markokoro@gmail.com
3            lekanokoro@gmail.com
Name: email, dtype: object

In [34]:
type(df['email']) #A series is a list of data
#Data frame = rows and columns
#Series = rows of a single column therefore a dataframe is a container for multiple series objects

pandas.core.series.Series

In [35]:
#We can access a single column of a dataframe, like we access a key in dictionary
df.email

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
2             markokoro@gmail.com
3            lekanokoro@gmail.com
Name: email, dtype: object

In [36]:
#We can also access multiple columns (not a series-which is a SINGLE COLUMN of rows) it is esentially a filtered down dataframe
df[['last', 'email']]

      last                         email
0  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1    Sleep           marysleep@gmail.com
2    Okoro           markokoro@gmail.com
3    Okoro          lekanokoro@gmail.com

In [37]:
df.columns #to see all our columns

Index(['first', 'last', 'email'], dtype='object')

In [53]:
df=pd.DataFrame(people)

In [55]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

### How to get our rows using the "loc" and "iloc" index

In [56]:
#iloc - allows us to access rows by integer location

df.iloc[0]  #returns a series that contains the values of that first row of data

first                        Chidinma
last                          Ukaegbu
email    chidinmaukaegbu.cu@gmail.com
Name: 0, dtype: object

In [57]:
#selecting multiple rows
df.iloc[[0,1]]

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com

In [58]:
#we can also select columns with the iloc
df.iloc[[0,1],2]

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
Name: email, dtype: object

In [59]:
#loc - searching by labels for rows (indexes)
df.loc[0]

first                        Chidinma
last                          Ukaegbu
email    chidinmaukaegbu.cu@gmail.com
Name: 0, dtype: object

In [60]:
df.loc[[0,1]]

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com

In [61]:
df.loc[[0,1], 'email']  #getting the email value of the first two rows

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
Name: email, dtype: object

In [62]:
df.loc[[0,1], ['email', 'last']]

                          email     last
0  chidinmaukaegbu.cu@gmail.com  Ukaegbu
1           marysleep@gmail.com    Sleep

## How to set custom indexes

In [63]:
df = pd.DataFrame(people)
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [64]:
df['email']

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
2             markokoro@gmail.com
3            lekanokoro@gmail.com
Name: email, dtype: object

In [65]:
df.set_index('email',inplace = True)   #to set the email addresses as the index for this data frame

#to set the index to the email column and have those changes carry on to future cells use ",inplace = True"

In [66]:
df #you can see that it set the index to email and modified the data frame

                                 first     last
email
chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
marysleep@gmail.com               Mary    Sleep
markokoro@gmail.com               Mark    Okoro
lekanokoro@gmail.com             Lekan    Okoro

In [67]:
df.index  #to look specifically at that index

Index(['chidinmaukaegbu.cu@gmail.com', 'marysleep@gmail.com',
       'markokoro@gmail.com', 'lekanokoro@gmail.com'],
      dtype='object', name='email')

In [68]:
#to get the row for a specific email index use loc, remember that our index section is now email section
df.loc['chidinmaukaegbu.cu@gmail.com']      #it prints out the details attached to the email.

first    Chidinma
last      Ukaegbu
Name: chidinmaukaegbu.cu@gmail.com, dtype: object

In [69]:
df.reset_index(inplace = True)  #this is to reset the index and move the email to the first column 
df

                          email     first     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
1           marysleep@gmail.com      Mary    Sleep
2           markokoro@gmail.com      Mark    Okoro
3          lekanokoro@gmail.com     Lekan    Okoro

In [70]:
df

                          email     first     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
1           marysleep@gmail.com      Mary    Sleep
2           markokoro@gmail.com      Mark    Okoro
3          lekanokoro@gmail.com     Lekan    Okoro

### Filtering Data from Dataframes and series objects

In [71]:
#getting the every one that has the last name of 'okoro'
df['last'] == 'Okoro'

0    False
1    False
2     True
3     True
Name: last, dtype: bool

In [72]:
filt = (df['last'] == 'Okoro')

applying this 'filter' to our data frame, narrowing down the rows

df[filt]

In [73]:
#remember that '.loc' is used to look up names and columns by label
df.loc[filt, 'email']  #first value in loc(filt) are the rows we want, 2nd value in loc (email) are the columns we want

2     markokoro@gmail.com
3    lekanokoro@gmail.com
Name: email, dtype: object

### Filtering data using the '&' and '|' symbols

trying to get all of the rows where the last name is 'okoro' and the first name is 'Mark'

In [74]:
filt = (df['last'] == 'Okoro') & (df['first'] == 'Mark')

df.loc[filt, 'email']

2    markokoro@gmail.com
Name: email, dtype: object

In [75]:
filt = (df['last'] == 'Ukaegbu') | (df['first'] == 'Mary')

#trying to get all of the rows where the last name is 'Ukaegbu' or the first name is 'Mary'

In [76]:
df.loc[filt, 'email']

0    chidinmaukaegbu.cu@gmail.com
1             marysleep@gmail.com
Name: email, dtype: object

In [77]:
#to get the opposite of the result, use the '-' sign
df.loc[-filt, 'email']

2     markokoro@gmail.com
3    lekanokoro@gmail.com
Name: email, dtype: object

## How to alter existing rows and columns in our dataframe

In [78]:
df.columns #this brings out the names of the columns

Index(['email', 'first', 'last'], dtype='object')

In [79]:
df.columns = ['first_name', 'last_name', 'email']
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [80]:
df

                     first_name last_name    email
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
1           marysleep@gmail.com      Mary    Sleep
2           markokoro@gmail.com      Mark    Okoro
3          lekanokoro@gmail.com     Lekan    Okoro

In [81]:
#you can use list comprehension to uppercase, lower case etc columns
df.columns = [x.lower() for x in df.columns]
df

                     first_name last_name    email
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
1           marysleep@gmail.com      Mary    Sleep
2           markokoro@gmail.com      Mark    Okoro
3          lekanokoro@gmail.com     Lekan    Okoro

In [82]:
df.columns = df.columns.str.replace(' ', '_') #this is if you want to replace the space with underscore (_) in your column

In [83]:
df.rename(columns = {'first_name' : 'first', 'last_name' : 'last'}, inplace = True) #this is to rename some columns not all of them

In [84]:
df

                          first      last    email
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Ukaegbu
1           marysleep@gmail.com      Mary    Sleep
2           markokoro@gmail.com      Mark    Okoro
3          lekanokoro@gmail.com     Lekan    Okoro

#### Updating Data in our rows

In [98]:
df=pd.DataFrame(people)

In [100]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [101]:
df.loc[2] #to get the row of 'Mark Okoro'

first                   Mark
last                   Okoro
email    markokoro@gmail.com
Name: 2, dtype: object

In [102]:
df.loc[2] = ['Mark', 'Raymond', 'markraymond@gmail.com'] #this would alter the row 2

In [103]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark  Raymond         markraymond@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [104]:
df.loc[2, ['last', 'email']] = ['Okoro', 'markokoro@gmail.com']

In [105]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [106]:
#changing a single value, you pass in a single row and a single column and change the value
df.loc[2, 'last'] = 'Raymond'

In [107]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark  Raymond           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [108]:
#'at' meant for changing or looking up a single value
df.at[2, 'last'] = 'Okoro'

In [109]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [110]:
#how to alter the rows without using '.loc' or '.at'
filt = (df['email'] == 'markokoro@gmail.com')

In [111]:
df.loc[filt,'last'] = 'Raymond'

In [112]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark  Raymond           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

In [113]:
df.loc[filt,'last'] = 'Okoro'

In [114]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

#### Updating Multiple Rows of Data

In [115]:
#df['email'] = df['email'].str.lower() #this returns lowercase values of the email (if they are in upper case)

- apply
- map
- applymap
- replace

apply - used for calling a function on our values. It can work on a data frame or series object
when you use apply on a series, they can apply a function to every value in our series

In [116]:
df['email'].apply(len) #it counts the length of the email addresses.

0    28
1    19
2    19
3    20
Name: email, dtype: int64

In [117]:
#you can also use 'apply' to update functions as well

def update_email(email):
    return email.upper()

In [118]:
df['email'].apply(update_email)

0    CHIDINMAUKAEGBU.CU@GMAIL.COM
1             MARYSLEEP@GMAIL.COM
2             MARKOKORO@GMAIL.COM
3            LEKANOKORO@GMAIL.COM
Name: email, dtype: object

In [119]:
df['email'] = df['email'].apply(update_email) #applying the uppercase email to our data base

In [120]:
df

      first     last                         email
0  Chidinma  Ukaegbu  CHIDINMAUKAEGBU.CU@GMAIL.COM
1      Mary    Sleep           MARYSLEEP@GMAIL.COM
2      Mark    Okoro           MARKOKORO@GMAIL.COM
3     Lekan    Okoro          LEKANOKORO@GMAIL.COM

#### lambda functions - these are anonymous functions without a specific name attached to them

In [121]:
df['email'] = df['email'].apply(lambda x:x.lower()) #returning the size to lowercase using the lambda function

In [122]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

When we run 'apply' on a dataframe it runs a function on each row or column of that dataframe

In [123]:
df['email'].apply(len)

0    28
1    19
2    19
3    20
Name: email, dtype: int64

In [124]:
df.apply(len, axis = 'columns') #checks the length of the rows, uses 'column' not 'rows'

0    3
1    3
2    3
3    3
dtype: int64

In [125]:
#getting the minimum value of each column

In [126]:
#running 'apply' on a series applies a function to every value in the series.
#running 'apply' to a dataframe applies a function to every series in the dataframe.

'Apply Map' is used to apply a function to every element in the data frame.
'Apply map' only works on data frames, series objects don't have the 'apply map' method.

In [127]:
#Passing the 'len' function to the 'apply map'

In [128]:
df.applymap(len)

#it applies the 'len' function to each individual value in the dataframe

   first  last  email
0      8     7     28
1      4     5     19
2      4     5     19
3      5     5     20

In [129]:
df.applymap(str.lower) #makes all the elements in our dataframe lowercase. if we had numerical data in our df, we would get an error since you can't run strings on numbers

      first     last                         email
0  chidinma  ukaegbu  chidinmaukaegbu.cu@gmail.com
1      mary    sleep           marysleep@gmail.com
2      mark    okoro           markokoro@gmail.com
3     lekan    okoro          lekanokoro@gmail.com

'Map' method only works on a series. It is used for substituting each value in a series with another value.

In [130]:
#to substitute a couple of our 'first names

df['first'].map({'Chidinma':'Franca', 'Mary':'Anita', 'Lekan':'Samuel'})

0    Franca
1     Anita
2       NaN
3    Samuel
Name: first, dtype: object

Replace Method

In order to keep the other names, you don't want to replace and still be able to replace the ones you want to, you can use the 'Replace Method'.

In [131]:
df['first'].replace({'Chidinma':'Franca', 'Mary':'Anita', 'Lekan':'Samuel'})

0    Franca
1     Anita
2      Mark
3    Samuel
Name: first, dtype: object

In [132]:
df['first'] = df['first'].replace({'Chidinma':'Franca', 'Mary':'Anita', 'Lekan':'Samuel'}) 
#this makes the final changes to your dataframe.

In [133]:
df

    first     last                         email
0  Franca  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1   Anita    Sleep           marysleep@gmail.com
2    Mark    Okoro           markokoro@gmail.com
3  Samuel    Okoro          lekanokoro@gmail.com

In [134]:
df['first'] = df['first'].replace({'Franca':'Chidinma', 'Anita':'Mary', 'Samuel':'Lekan'})

In [135]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com

## How to Add and Remove Columns from our Dataframe

#### Adding Columns

In [136]:
#Combining our First and Last name column into a single column

df['first'] + ' ' + df['last']

0    Chidinma Ukaegbu
1          Mary Sleep
2          Mark Okoro
3         Lekan Okoro
dtype: object

In [137]:
df['full_name'] = df['first'] + ' ' + df['last'] #giving that column a new name.

In [138]:
df

      first     last                         email         full_name
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com  Chidinma Ukaegbu
1      Mary    Sleep           marysleep@gmail.com        Mary Sleep
2      Mark    Okoro           markokoro@gmail.com        Mark Okoro
3     Lekan    Okoro          lekanokoro@gmail.com       Lekan Okoro

#### Removing Columns

we use the 'drop' method to do this

In [139]:
df.drop(columns = ['first', 'last'], inplace = True) 
#remeber that 'inplace = True' ensures that those changes take place.

In [140]:
df

                          email         full_name
0  chidinmaukaegbu.cu@gmail.com  Chidinma Ukaegbu
1           marysleep@gmail.com        Mary Sleep
2           markokoro@gmail.com        Mark Okoro
3          lekanokoro@gmail.com       Lekan Okoro

To reverse the process and split the 'full_name' column to 2 different columns, we use the (string split) method

In [141]:
df['full_name'].str.split(' ')

0    [Chidinma, Ukaegbu]
1          [Mary, Sleep]
2          [Mark, Okoro]
3         [Lekan, Okoro]
Name: full_name, dtype: object

To assign the above to 2 different columns, we need to expand the list so that they are in 2 different columns, we use the 'expand argument' for this

In [142]:
df['full_name'].str.split(' ', expand = True)

          0        1
0  Chidinma  Ukaegbu
1      Mary    Sleep
2      Mark    Okoro
3     Lekan    Okoro

Now that we have 2 columns, we set them to those 2 columns that were returned

In [143]:
#to access multiple columns, we have 2 brackets, the inner bracket is our list of columns

df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [144]:
df

                          email         full_name     first     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma Ukaegbu  Chidinma  Ukaegbu
1           marysleep@gmail.com        Mary Sleep      Mary    Sleep
2           markokoro@gmail.com        Mark Okoro      Mark    Okoro
3          lekanokoro@gmail.com       Lekan Okoro     Lekan    Okoro

### How to Add and Remove Rows from our Dataframe

#### Adding Rows

Adding a single row of data, we do this with the 'append' method.

In [145]:
df.append({'first':'Sarah'}, ignore_index = True) 

#it adds the new row for sarah to our dataframe.

                          email         full_name     first     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma Ukaegbu  Chidinma  Ukaegbu
1           marysleep@gmail.com        Mary Sleep      Mary    Sleep
2           markokoro@gmail.com        Mark Okoro      Mark    Okoro
3          lekanokoro@gmail.com       Lekan Okoro     Lekan    Okoro
4                           NaN               NaN     Sarah      NaN

Adding a new dataframe to our existing dataframe

In [146]:
people_1 = {
    "first" : ["Rita", "Martin"],
    "last" : ["Eke", "Chuks"],
    "email" : ["ritaeke@gmail.com", "martinchuks@gmail.com"]
}

df2 = pd.DataFrame(people_1)

In [147]:
df2

    first   last                  email
0    Rita    Eke      ritaeke@gmail.com
1  Martin  Chuks  martinchuks@gmail.com

In [148]:
df.append(df2) #we can see that it restarts the index and also gives us a warning.

df.append(df2, ignore_index = True, sort = True)

C:\Users\chidi\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

                          email     first         full_name     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Chidinma Ukaegbu  Ukaegbu
1           marysleep@gmail.com      Mary        Mary Sleep    Sleep
2           markokoro@gmail.com      Mark        Mark Okoro    Okoro
3          lekanokoro@gmail.com     Lekan       Lekan Okoro    Okoro
4             ritaeke@gmail.com      Rita               NaN      Eke
5         martinchuks@gmail.com    Martin               NaN    Chuks

In [149]:
df = df.append(df2, ignore_index = True, sort = True) #this makes our change in the dataframe permanent

In [150]:
df

                          email     first         full_name     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Chidinma Ukaegbu  Ukaegbu
1           marysleep@gmail.com      Mary        Mary Sleep    Sleep
2           markokoro@gmail.com      Mark        Mark Okoro    Okoro
3          lekanokoro@gmail.com     Lekan       Lekan Okoro    Okoro
4             ritaeke@gmail.com      Rita               NaN      Eke
5         martinchuks@gmail.com    Martin               NaN    Chuks

#### Removing Rows

To remove rows, we can pass in the index that we want to drop.

In [151]:
df.drop(index = 5)

                          email     first         full_name     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Chidinma Ukaegbu  Ukaegbu
1           marysleep@gmail.com      Mary        Mary Sleep    Sleep
2           markokoro@gmail.com      Mark        Mark Okoro    Okoro
3          lekanokoro@gmail.com     Lekan       Lekan Okoro    Okoro
4             ritaeke@gmail.com      Rita               NaN      Eke

To remove 2 rows at once, example: removing the 2 names with the surname 'Okoro'

In [155]:
filt = df['last'] == 'Okoro'
df.drop(index = df[filt].index)

                          email     first         full_name     last
0  chidinmaukaegbu.cu@gmail.com  Chidinma  Chidinma Ukaegbu  Ukaegbu
1           marysleep@gmail.com      Mary        Mary Sleep    Sleep
4             ritaeke@gmail.com      Rita               NaN      Eke
5         martinchuks@gmail.com    Martin               NaN    Chuks

## How To Sort Our Data

In [156]:
df=pd.DataFrame(people)

In [157]:
df

      first     last                         email
0  Chidinma  Ukaegbu  chidinmaukaegbu.cu@gmail.com
1      Mary    Sleep           marysleep@gmail.com
2      Mark    Okoro           markokoro@gmail.com
3     Lekan    Okoro          lekanokoro@gmail.com